#include "calculator.h"

int Calculator::Add (double a, double b)
{
    return a + b + 0.5;
}

int Calculator::Sub (double a, double b)
{
    return Add (a, -b);
}

int Calculator::Mul (double a, double b)
{
    return a * b + 0.5;
}
Ще не вмерла України, ні слава, ні воля,
Ще нам, браття молодії, усміхнеться доля!
Згинуть наші воріженьки, як роса на сонці,
Запануєм і ми, браття, у своїй сторонці!
Душу й тіло ми положим за нашу свободу
І — покажем, що ми, браття, козацького роду!
Душу й тіло ми положим за нашу свободу
І — покажем, що ми, браття, козацького роду!